package com.liuxv.databinding.config;

import com.liuxv.databinding.R;

/**
 * @author liuxu@gmail.com (Liu Xu)
 */
public class Constants {

  public static final int[] AVATAR_LIST = {R.drawable.dk, R.drawable.dh, R.drawable.pom,
      R.drawable.lich, R.drawable.fs, R.drawable.bm, R.drawable.am, R.drawable.sq, R.drawable.koc,
      R.drawable.dr, R.drawable.es};

  public static final String[] TITLE_LIST = {"阿尔萨斯·米奈希尔", "伊利丹·怒风", "泰兰德·语风", "克尔苏加德", "萨尔",
      "格罗姆·地狱咆哮", "吉安娜·普罗德摩尔", "乌瑟尔", "玛法里奥·怒风", "希尔瓦娜斯·风行者", "凯恩·血蹄"};

  public static final String[] DETAIL_LIST =
      {
          "     阿尔萨斯是魔兽系列中最具悲剧色彩的英雄人物，原为洛丹伦王国的王子，白银之手骑士团英勇无私的圣骑士，后为保卫家园人民而受到巫妖王的蛊惑，因意见不合和导师、爱人敌对，在强烈的复仇意念冲击下，拿起了受到诅咒的武器霜之哀伤——能够吞噬别人灵魂的上古魔剑；阿尔萨斯从中获得了力量，却沦为一名信仰黑暗的死亡骑士。之后他弑父夺位，将整个洛丹伦王国化为人间地狱，最后踏上冰封王座与巫妖王合体成了新的巫妖王。",
          "     伊利丹‧怒风在上古之战之前就诞生了，这场冲突在第三次战争的一万年前爆发，混沌的燃烧军团再度入侵了艾泽拉斯。出于对力量的渴望（以及想打动泰兰德·语风），伊利丹和燃烧军团签订契约，利用神器“恶魔之魂”的力量让他们的领袖萨格拉斯进入艾泽拉斯。伊利丹的双胞胎哥哥玛法里奥·怒风奋力破坏了燃烧军团的计划；恶魔被击败，而伊利丹也被囚禁了起来。\n     在第三次战争中，泰兰德从千年的囚禁中解放了伊利丹，希望背叛者能奋起抗击燃烧军团以赎罪。虽然伊利丹为了保卫同胞而战，但他很快就堕入黑暗之中：在吸收了古尔丹之颅的能量后，他变成了恶魔，更因此遭到玛法里奥放逐。二度犯下重罪的伊利丹逃离暗夜精灵的怒火，他再度和唯一会接纳他的群体结盟：燃烧军团。伊利丹的恶魔主人指示他去消灭已摆脱它们控制的巫妖王，但他失败了。为了保护自己免遭燃烧军团的报复，伊利丹藏身外域，他希望有朝一日能统治这片破碎的世界。\n",
          "     泰兰德出生于数千年前，与玛法里奥·怒风和伊利丹·怒风一共长大。她响应了暗夜精灵的月亮女神的追随者们，艾露恩姐妹会的召唤，成为一名新手女祭司。而怒风兄弟则走上了另一条道路。但当燃烧军团降临艾泽拉斯，他们的命运又再次发生了交集。\n     泰兰德和玛法里奥走到了一起，并肩抵抗入侵的恶魔；而伊利丹则走上了一条黑暗的不归路，他假意与燃烧军团合作，并臣服于力量的诱惑。在击败燃烧军团，并发生大分裂之后，泰兰德和玛法里奥帮助重建的精灵国度；而伊利丹则被囚禁在海加尔山之下。\n     但相聚的时光总是短暂，暗夜精灵在海加尔山安顿下来之后不久，玛法里奥和其他暗夜精灵德鲁伊就不得不进入翡翠梦境。当玛法里奥沉睡在翡翠梦境中时，泰兰德领导她的人民组建了暗夜精灵的部队——哨兵，以守护他们的土地和盟友。\n",
          "     在肯瑞托中并非没有包括通灵术在内的亡灵魔法，但是人类社会的主流价值观排斥亡灵魔法的存在。即使是第一批向精灵学习魔法的人类法师，曾经的大法师梅里在转化为尸巫（或者说干尸法师）之后仍然被逐出了达拉然（关于梅里的故事详见麦德安词条）。所以说痴迷于通灵术的克尔苏加德与肯瑞托的普世价值格格不入也就成了必然。\n     在兽人战争结束后，收缴的兽人术士死亡魔法和兽人死亡骑士的资料被带到了达拉然，锁进了紫罗兰图书馆，而痴迷于通灵术的克尔苏加德利用他大法师的身份获取了这些资料并开始进行一些危险的实验，虽然实验材料仅仅是一些小白鼠，但是这些僵尸化的小动物仍然引起了周围农夫的不安，也对肯瑞托法师的声望造成了不好的影响。大法师安东尼达斯为此警告了克尔苏加德，克尔苏加德表面上答应了安东尼达斯，但是背地里仍然偷偷进行着他的通灵术实验。也因此，克尔苏加德和其他肯瑞托法师的关系越来越差。\n",
          "     “萨尔”是兽人古伊尔年轻时候的绰号，那时他住在自己的第一个家，也就是为了让第二次战争的兽人囚犯再也无法威胁艾泽拉斯而建的监狱；而萨尔，正是奴隶之意。古伊尔逃出监狱后并没有漫无目的地游荡，而是踏上寻根之旅，最后从先祖的萨满信仰中寻得了智慧。\n     萨尔的萨满信仰指引着他的行动，他重整了部落，成为大酋长并领导他的人民在贫瘠之地上定居，那里正是以他的父亲杜隆坦的名字而命名的杜隆塔尔。萨尔领导部落通过了一连串似乎永无止境的试炼：除去兽人身上恶魔之血的诅咒，抵挡燃烧军团对海加尔山发动的攻击，以及击败可怕的巫妖王。当死亡之翼重返人间并撕裂世界，萨尔从部落大酋长的位置退下，加入了大地之环这个强大的萨满组织，企图平息元素并阻止灭世者。萨尔选择加尔鲁什·地狱咆哮做为继任者，然而这个决定一直困扰着他，因为新任大酋长却把部落带上了内乱的歧途。\n",
          "     高傲的战歌氏族酋长——格罗玛什·地狱咆哮从不言败。手握传奇之斧血吼，每一击都能让参差不齐的斧刃在风中嘤嘤作响，被众部下视为战斗的号角。他的力量无可匹敌，但缺乏克制力。当他莽撞的进攻最终让自己损失惨重时，他仍然拒绝束手就擒，硬生生地从惨败中杀出血路并成功复仇。他的勇猛传遍了整个德拉诺，成为了一代传奇。他的儿子，加尔鲁什活在了父亲的威名之下。\n     在成功联合兽人众氏族之前，格罗玛什接见了一位陌生人。这位来历神秘的顾问很快赢得了战歌酋长的信任，他就是曾经活在自己父亲威名之下的那个男孩——加尔鲁什·地狱咆哮。他警告格罗玛什，有一个叛徒正密谋让恶魔奴役兽人。格罗玛什借此机会将惊天阴谋大白于天下，成功让自己成为联合几乎所有兽人氏族的领袖人物。在其巨大的威信下，格罗玛什将兽人打造成不再受命运束缚的“钢铁部落”，准备实现自己的命运。如今，他的大军已经开始向塔拉多的沙塔斯、影月谷中的德莱尼圣殿、霜火岭的霜狼要塞进发。一旦他的征服计划成功，众多世界都将像德拉诺一样陷入钢铁部落的铁蹄之下。\n     当战争结束后，吉安娜管理着塞拉摩岛，致力于促进部落与联盟间的关系。她是一位热心的调解者，特别是在诺森德战争期间，她极力平息加尔鲁什·地狱咆哮和瓦里安·乌瑞恩之间的冲突，并在阿尔萨斯王子完全变成巫妖王后试图唤醒他的人性。吉安娜的和平立场与性格在接任萨尔成为部落大酋长的加尔鲁什·地狱咆哮以一颗魔法炸弹夷平塞拉摩后改变了。身为肯瑞托的新领袖，她拥有让加尔鲁什为他酿成的惨剧付出血的代价的权力与决心。\n",
          "     吉安娜是戴林·普罗德摩尔的女儿，她的父亲则是库尔提拉斯海滨王国的最高统治者，也是第二次战争期间的联盟海军上将。吉安娜从小在魔法学习上就天赋异禀。她在肯瑞托的领袖安东尼达斯门下求学，而肯瑞托是一个在魔法之都达拉然生活及工作的法师议会。 在吉安娜成年早期，她致力于阻止将引发第三次战争的天灾瘟疫传播，同时也看着她的挚友及浪漫情人，阿尔萨斯·米奈希尔王子，一步步走向黑暗深渊。当战况加剧后，吉安娜获得了新部落大酋长萨尔的信任，成为团结艾泽拉斯各族携手对抗燃烧军团的关键人物。\n     当战争结束后，吉安娜管理着塞拉摩岛，致力于促进部落与联盟间的关系。她是一位热心的调解者，特别是在诺森德战争期间，她极力平息加尔鲁什·地狱咆哮和瓦里安·乌瑞恩之间的冲突，并在阿尔萨斯王子完全变成巫妖王后试图唤醒他的人性。吉安娜的和平立场与性格在接任萨尔成为部落大酋长的加尔鲁什·地狱咆哮以一颗魔法炸弹夷平塞拉摩后改变了。身为肯瑞托的新领袖，她拥有让加尔鲁什为他酿成的惨剧付出血的代价的权力与决心。\n",
          "     乌瑟尔·光明使者是白银之手骑士团的领袖，同时也是大主教阿隆索斯·法奥(Alonsus Faol)之徒。第二次战争中，在兽人的连续进攻之下，就连坐落于艾泽拉斯的艾尔文森林的北郡修道院也惨遭涂炭。当暴风城被兽人攻陷，莱恩国王遇害之后，乌瑟尔跟随法奥和安度因·洛萨同往洛丹伦王国寻求援助。鉴于艾泽拉斯战役的教训和迫在眉睫的兽人的威胁，法奥决定重建洛丹伦王国(Lordaeron)的圣教组织，并由他的学徒兼助手乌瑟尔来全权负责。这就是后世著名的“白银之手”骑士团。而乌瑟尔以他无比的虔诚和坚定，成为了这支圣骑士队伍的先行者，担任起白银之手和洛萨率领的洛丹伦联盟军队的联络人的职责。\n",
          "     在德鲁伊的守护神、半神塞纳留斯的指引下，可敬的玛法里奥·怒风千年以来一直保护着暗夜精灵不受恶魔侵扰。在上古之战中，玛法里奥与其他英雄一起，为了保护艾泽拉斯的所有生命，抵抗过可怕的燃烧军团，这其中就有他未来的恋人泰兰德·语风和他的弟弟伊利丹。在战胜恶魔之后，他又努力带领暗夜精灵离开被燃烧军团摧毁的故土，在海加尔山附近重建家园，并监督着世界之树，诺达希尔的生长。守护巨龙伊瑟拉将诺达希尔与翡翠梦境连接起来——那是一个没有战争，也不受凡俗众生影响的、艾泽拉斯的倒影——并允许所有的德鲁伊，包括玛法里奥进入这个国度。玛法里奥和其他德鲁伊就在这片梦境中探索了数百年之久。\n     在第三次大战中，泰兰德唤醒了玛法里奥，请他再次协助抵抗燃烧军团。在苏醒之后，他与自己的宿敌，试图从内部腐蚀翡翠梦境的萨特萨维斯进行了激战。在大灾变中，死亡之翼大肆破坏世界并激起了元素的愤怒。玛法里奥毅然离开暗夜精灵主城达纳苏斯，并召集他的德鲁伊同伴再次拯救艾泽拉斯，并组成了特别部队，阻止了邪恶的炎魔拉格纳罗斯的入侵。随着灭世者的死亡，彻底觉醒的玛法里奥与泰兰德终于团聚并一同支持联盟的行动。\n",
          "     希尔瓦娜斯曾经是银月城的游侠将军，奉命保卫奎尔萨拉斯的精灵王国。她在第三次战争中阵亡，家园遭到阿尔萨斯·米奈希尔和亡灵天灾军团的蹂躏，但是死亡并非她的终点。阿尔萨斯残忍地将她的灵魂与身体剥离，将她化为充满仇恨的女妖，成为天灾军团的一员。当伊利丹·怒风的攻击削弱了巫妖王，希尔瓦娜斯意志与其坚强的亡灵摆脱了他的控制，在洛丹伦王国的废墟下建立了新家园。他们称自己为“被遗忘者”，发誓不惜代价铲除巫妖王。\n     努力使部落接纳他们后，希尔瓦娜斯率领“同胞”前往诺森德征讨巫妖王。就在成功前夕，被遗忘者之中发生叛乱并杀害了联盟与部落的成员，使得希尔瓦娜斯蒙受质疑。她开始思考被遗忘者绝望的未来；他们受人轻视且无法繁衍后代。最后，女妖之王和瓦格里订下契约，这些可怕的生物可以创造出更多的亡灵，让被遗忘者有机会在艾泽拉斯继续生存下去。\n",
          "     兽人中的传奇英雄，牛头人酋长凯恩·血蹄不仅是一位勇敢的战士更是牛头人部落的伟大领袖。一直以来，疯狂的半人马一直猛烈地攻击牛头人的定居点和商队。但凯恩却从未失去信心，他坚信一定能找到一条出路，让他的子民度过这段艰难的日子，并最终过上和平安宁的生活。\n     一次偶然的机会，凯恩在卡利姆多的东海岸遇见了年轻兽人的新领袖萨尔。得到萨尔和霜狼氏族的倾力相助，凯恩最终得以击退半人马可汗的屡次进犯。在抵抗燃烧军团的入侵之后，凯恩协助萨尔建立了奥格瑞玛，并带领雷霆崖的牛头人加入了部落阵营。大灾变之后，凯恩与部落代理大酋长加尔鲁什·地狱咆哮的生死决斗中被恐怖图腾的首领玛加萨下毒杀害，一代传奇牛头人酋长就此谢幕。\n"};


  public static final HeroStatus[] STATUS_LIST = {HeroStatus.ALIVE, HeroStatus.DEATH,
      HeroStatus.ALIVE, HeroStatus.DEATH, HeroStatus.ALIVE, HeroStatus.DEATH, HeroStatus.ALIVE,
      HeroStatus.DEATH, HeroStatus.ALIVE, HeroStatus.DEATH, HeroStatus.DEATH};



  public static enum HeroStatus {
    DEATH, ALIVE
  }
}
